app/controllers/products_controller.rb

  def admin
    @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)
    @products = Product.all
    if @product.save
---
INSERT INTO "products" ("title", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "fjh"], ["image_url", "dg"], ["created_at", "2016-03-22 21:04:14.193540"], ["updated_at", "2016-03-22 21:04:14.193540"]]

  def update
    @product = Product.find(params[:id])
    @products = Product.all
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "products".* FROM "products"
UPDATE "products" SET "title" = $1, "image_url" = $2, "stock" = $3, "price" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["title", "Beats"], ["image_url", "placeholder1.png"], ["stock", 1], ["price", 56.0], ["updated_at", "2016-03-23 03:37:50.207722"], ["id", 6]]